{
  "assessment": {
    "title": "محصول سورنا",
    "intro": "این گزارش به ارزیابی محصول سورنا (یک محصول فرضی) می‌پردازد که متعلق به شرکت آریا می‌باشد. هدف از ارزیابی، چکاپ کلی رویه‌ها و اصول مهندسی نرم‌افزار در توسعه این محصول و یافتن راهکارهایی برای بهبود وضعیت است. این محصول از جنس سیستم‌های سازمانی (Enterprise) با مقیاس و حساسیت بالاست.",
    "executiveSummary": "تیم ارزیابی، سطح بلوغ کلی سامانه سورنا را «قابل قبول» برآورد می‌کند که امتیاز ۴ از ۵ محسوب می‌شود و به این معنی است که این محصول در مجموع حداقل توقعات را پوشش می‌دهد. لازم به تاکید است که میزان اطمینان تیم ارزیابی از این برآورد ۶۲ درصد است که اطمینان مناسبی محسوب نمی‌شود. فراهم نشدن امکان مصاحبه با نمایندگانی از مشتریان محصول، عدم وجود مستندات کافی و به‌روز و عدم دسترسی به کد مهمترین موانع افزایش ضریب اطمینان به نتیجه این ارزیابی هستند. پیشنهاد می‌شود ضمن برنامه‌ریزی برای رفع این موانع ارزیابی بعد از یک وقفه دو ماهه با عمق بیشتر تکرار گردد. اگر مایل هستید از فرایند ارزیابی و نحوه رسیدن به این امتیازات مطلع شوید، مطالعه بخش «این گزارش چگونه ساخته شد؟» به شما کمک می‌کند. امتیاز کلی، از میانگین وزنی ۱۱ شاخص به دست آمده است. این شاخص‌ها در سه موضوع نرم‌افزار، تیم و محیط عملیات دسته‌بندی شده‌اند.",
    "assessmentKit": {
      "id": 393,
      "title": "Internal Software Team Audit",
      "maturityLevelCount": 5,
      "questionsCount": 146,
      "questionnairesCount": 146,
      "attributesCount": 11,
      "prosAndCons": "همان‌گونه که در نمودار فوق قابل ملاحظه است،‌ قابل توجه‌ترین شاخص مثبت محصول، «قابلیت اطمینان نرم‌افزار» و «نگهداشت‌پذیری نرم‌افزار» هستند. این مزیت با اتکا به تست‌های خودکار، پایپ‌لاین CI/CD مناسب، وجود زیرساخت ابری و چرخه کد قابل قبول محقق شده است. در مقابل، شاخص‌ «بهینگی نرم‌افزار» و «اطمینان‌پذیری عملیات» نیاز به رسیدگی دارند. ضمناً با وجود این که «مقیاس‌پذیری نرم‌افزار» در وضعیت قابل قبول قرار دارد، مقیاس و حساسیت این سامانه ایجاب می‌کند همچنان این شاخص مورد توجه بیشتری قرار گیرد.",
      "maturityLevels": [
        {
          "id": 2128,
          "title": "توسعه نیافته",
          "index": 1,
          "value": 1,
          "description": "کار خاصی انجام نشده است."
        },
        {
          "id": 2129,
          "title": "ناقص",
          "index": 2,
          "value": 2,
          "description": "کارهای اندکی انجام شده و ضعف وجود دارد."
        },
        {
          "id": 2130,
          "title": "قابل نقد",
          "index": 3,
          "value": 3,
          "description": "اقدامات قابل توجهی انجام شده ولی وضعیت هنوز قابل قبول نیست."
        },
        {
          "id": 2131,
          "title": "قابل قبول",
          "index": 4,
          "value": 4,
          "description": "وضعیت قابل قبول است."
        },
        {
          "id": 2132,
          "title": "عالی",
          "index": 5,
          "value": 5,
          "description": "وضعیت از حداقل مطلوب بهتر است و کارهای خاصی انجام شده است."
        }
      ]
    },
    "maturityLevel": {
      "id": 2131,
      "title": "قابل قبول",
      "index": 4,
      "value": 4,
      "description": "وضعیت قابل قبول است."
    },
    "confidenceValue": 60,
    "creationTime": "2024-10-23T07:38:58.529241"
  },
  "subjects": [
    {
      "id": 528,
      "title": "نرم‌افزار",
      "index": 1,
      "description": "این ارزیابی، سطح بلوغ کلی شاخص‌های مرتبط با «نرم‌افزار» را «قابل قبول» برآورد می‌کند. مقصود از نرم‌افزار «ساختار و کیفیت کد و فناوری‌ها فارغ از شرایط محیط عملیات» است. این امتیاز با ضریب اطمینان ۶۳ درصد گزارش می‌شود که ضریب اطمینان چندان مناسبی نیست. سطح بلوغ وضعیت نرم‌افزار از میانگین امتیاز شاخص‌های «اطمینان‌پذیری نرم‌افزار»، «نگهداشت‌پذیری نرم‌افزار»، «انتقال‌پذیری نرم‌افزار»، «مقیاس‌پذیری نرم‌افزار» و «بهینگی نرم‌افزار» به دست آمده که در ادامه راجع به نقاط قوت و ضعف سورنا در خصوص هر یک از این شاخص‌ها توضیح داده می‌شود.",
      "confidenceValue": 0,
      "maturityLevel": {
        "id": 2131,
        "title": "قابل قبول",
        "index": 4,
        "value": 4,
        "description": "وضعیت قابل قبول است."
      },
      "attributes": [
        {
          "id": 1961,
          "title": "نگهداشت‌پذیری",
          "translatedTitle": "Maintainability",
          "description": "میزان آمادگی نرم‌افزار برای تغییرات یا به عبارتی میزان ارزان، سریع و مطمئن بودن توسعه محصول",
          "analyzation": "تست خودکار در سطوح مختلف، کیفیت نسبتا خوب کد، ماژول‌بندی قابل قبول و ساده بودن معماری، از جمله مهم‌ترین عوامل موثر بر «قابل قبول» بودن وضعیت نگهداشت‌پذیری نرم‌افزار در سورنا است. از طرفی بالا بودن نسبی شاخص پیچیدگی کد، تاثیر منفی روی این ویژگی گذاشته است.",
          "index": 1,
          "confidenceValue": 57,
          "maturityLevel": {
            "id": 2131,
            "title": "قابل قبول",
            "index": 4,
            "value": 4,
            "description": "وضعیت قابل قبول است."
          }
        }
      ]
    }
  ],
  "questionnaires": [
    {
      "id": 3136,
      "title": "انسجام معماری",
      "description": "سازگاری در معماری، تناسب سبک معماری با نیاز، میزان یکپارچگی ماژول‌ها، پای‌بندی به اصول معماری",
      "index": 1,
      "questionCount": 10
    }
  ],
  "steps": [
    {
      "id": 3136,
      "title": "جلسه آغاز ارزیابی",
      "summary": "آشنایی با روال ارزیابی و هماهنگی‌های لازم",
      "description": "در تاریخ ۱۴۰۳/۰۷/۰۱ جلسه‌ای برای شروع همکاری با حضور تیم چکاپ، تیم توسعه و نماینده مدیریت شرکت برگزار و به این موضوعات زیر پرداخته شد: مرور فرایند چکاپ، تعیین نمایندگان طرفین، توافق روی برنامه زمانی و آموزش فلیکیت.",
      "index": 1
    }
  ],
  "recommendationsSummary": "مشاور با درک از وضعیت شاخص‌های اندازه‌گیری‌شده و شناخت ماهیت محصول در وضعیت فعلی، بهبود «نگهداشت‌پذیری نرم‌افزار» و «بهبود اطمینان‌پذیری نرم‌افزار» را به عنوان اهداف اصلی ارتقای کیفیت قلمداد می‌کند و در این راستا اقدامات زیر را پیشنهاد می‌نماید. ",
  "adviceItems": [
    {
      "id": "3136",
      "title": "بازآرایی مستندات",
      "priority": "high",
      "impact": "high",
      "cost": "low",
      "description": "داشتن یک سیستم مدیریت دانش مؤثر و روال‌های مناسب برای بروزرسانی آن‌ها، سبب می‌شود افراد مختلف درگیر در پروژه، به سرعت به اطلاعات مورد نیاز دسترسی پیدا کنند و از سردرگمی، ابهام، دوباره‌کاری و تکرار اشتباهات جلوگیری شود. همچنین مستنداتِ باکیفیت، نقش موثری در بزنگاه‌هایی مانند ورود نیروی جدید یا خروج افراد کلیدی ایفا می‌کنند. انسجام در مستندسازی هم یکی دیگر از نکات مهمی است که شایسته است به خوبی مورد توجه قرار گیرد. مستندات قدیمی لازم است حذف یا آرشیو شوند و مستندات موجود، در محل مناسبی که در دسترس همه ذی‌نغعان است قرار گرفته و مرتبا مورد ارجاع و استفاده قرار گیرند. مستند کردن و بروز نگه داشتنِ دلایل تصمیمات مهم طراحی و معماری نیز از دیگر مواردی است که ارزش صرف زمان و هزینه را دارد. چه بسا فراموشیِ دلایل تصمیمات مهم معماری در گذر زمان، تیم را دچار نقد و نقض اشتباه تصمیمات، محافظه‌کاری بی‌مورد یا تکرار فرایند تصمیم‌گیری نماید و نهایتا منجر به صرف هزینه و زمان بیشتر شود.خوش‌بختانه در دانش‌نامه سورنا مستندات بسیار زیادی وجود دارد که این نشان از وجود فرهنگ مستندسازی در تیم دارد. در عین حال، یکی از نقاط قابل بهبود سورنا بازآرایی و سازمان‌دهی بهتر مستندات است. طبق مشاهدات تیم ارزیابی، دسترسی به برخی از اسناد بعضاً از بیرون از دانشنامه صورت می‌گرفت. این موارد سبب می‌شود که یافتن یک مستند و یا حتی اطلاع از وجود یک مستند برای ذی‌نغعان از جمله مدیران به راحتی امکان‌پذیر نباشد و چه بسا منجر به مشکلات متعددی در تصمیم‌گیری‌های کلیدی شود.بهبود مستندات بیش از همه روی شاخص «ثبات کارایی تیم» و «چابکی تیم» اثرگذار خواهد بود."
    }
  ]
}
