{
  "assessmentReport": "Assessment report",
  "assessmentResult": "Assessment result",
  "assessmentKitEvaluatesMaturity": "This assessment kit evaluates the maturity of subjects and attributes across multiple levels.",
  "assessmentStructured": "This assessment is structured around {{count}} key attributes. Below, these attributes are listed and briefly explained. Ask ChatGPT",
  "attributesStatus": "Attributes status",
  "copyReportLink": "Copy report link",
  "contactExpertGroup": "Contact expert group",
  "contactExpertBoxText": {
    "intro": "This report has been generated using <strong>AI</strong>, based on your responses.",
    "points": [
      "If you have any questions or encounter issues,",
      "If you require a deeper, more detailed assessment by experts,"
    ],
    "outro": "Feel free to contact the expert group that developed the kit used in this assessment."
  },
  "contributionToAttribute": "Contribution to attribute (%)",
  "gainedScore": "Gained score (%)",
  "getMoreDetailedRecommendations": "Get more detailed recommendations",
  "howWasThisScoreCalculated": "How was this score calculated?",
  "howWasThisScoreCalculatedDesc": "The expert team that designed this kit has developed a specific computational algorithm for the attributes and their related measures. Based on these calculations, your responses to the questions lead to the final score and the maturity level of the attributes. In the chart, you can click on any attribute to see its score and related details. The area and color of each attribute show both its importance and the score from the assessment. Naturally, attributes with larger areas and lower scores require more attention",
  "howCanTheCurrentSituationBeImproved": "How can the current situation be improved?",
  "introduction": "Introduction",
  "introductionReport": "Report introduction",
  "isDraftSpaceReport": "To share this report, you can either make it public or move the related assessment to a space.",
  "kitWithTitle": "{{title}} kit",
  "peopleWithAccess": "People with access",
  "overallStatus": "Overall status",
  "participants": "Participants",
  "publishReport": "Publish report",
  "publicShareTitle": "Public access (No login required)",
  "publicShareDescription": "Anyone with the link can view the report without needing to login.",
  "questionsAndAnswer": "{{count}} questions and answers",
  "recommendations": "Recommendations",
  "howIsThisReportMade": "How was this report created?",
  "maturityMapOfAssessedAttributes": "Maturity map of assessed attributes",
  "measureGuidance": "The following metrics, with the contributions shown in the table, were used to calculate the “{{attribute}}” index. The blue and red bars indicate—out of the total attainable score for each metric—how much was gained and how much was lost.\n In addition, you can view the questions associated with each metric and the responses that led to these scores.",
  "measureTitle": "Measure",
  "measureMaturityLevel": "To measure the maturity level of each subject and its attributes {{QuestionnairesCount}} questionnaires, including a total of {{QuestionCount}} questions, are prepared. During the assessment process, each question will be scored. Each question may affect the score of one or more subject attributes. The following table presents these questionnaires.",
  "missedScore": "Missed score (%)",
  "reportIssues": "Report issues",
  "report": "report",
  "reportTitle": "Report",
  "requestAnExpertReview": "Request an expert review",
  "requestAnExpertReviewContent": "We can share your questionnaire responses with a team of experienced assessors who have domain-specific expertise aligned with your software. Their involvement can result in an assessment with greater accuracy, depth, and quality than the current AI-assisted report. <br/>Our specialists will be in direct contact with you throughout the process. <br/>Please note that this is a paid service. To explore a potential collaboration, please share your contact details and brief information about your software—such as business domain, brand name, and other relevant context.",
  "restrictedShareTitle": "Restricted access (Only users with access) ",
  "restrictedShareDescription": "Accessible only to users who’ve been given access.",
  "shareReport": "Share report",
  "shareReportViaEmail": "Share the report with new people via email...",
  "shareOptions": "Sharing options",
  "subjectsAndAttributes": "Subjects and Attributes",
  "treemapEmptyState": "Click on any attribute in the chart to view details",
  "total": "total",
  "viewReport": "View report",
  "whyAtThisLevel": "Why is \"{{attribute}}\" at the \"{{maturityLevel}}\" level?",
  "writeAboutParticipants": "Write about the participants and their roles in this assessment here...",
  "writeIntroduction": "Write the introduction of the report here...",
  "writeStepsForAssessment": "Write about the steps taken in this assessment here...",
  "writeStrengthAndAreas": "Write about strengths and areas for improvement here...",
  "writeYourInsightsOfTheAssessmentResultsHere": "Write your insights of the assessment results here..."
}
