{
  "accessAnyoneWithLink": "Anyone with this link",
  "accessAnyoneDescription": "Anyone with this link can view the report.",
  "accessRestricted": "Restricted",
  "accessStatus": "Access status",
  "assessmentReport": "Assessment report",
  "copyReportLink": "Copy report link",
  "contactExpertGroup": "Contact expert group",
  "contactExpertBoxText": {
    "intro": "This report has been generated using <strong>AI</strong>, based on your responses.",
    "points": [
      "If you have any questions or encounter issues,",
      "If you require a deeper, more detailed assessment by experts,"
    ],
    "outro": "Feel free to contact the expert group that developed the kit used in this assessment."
  },
  "disclaimer": "Clarification and Disclaimer",
  "disclaimerDescription": "This report was produced with an evidence-based evaluation approach and partially relies on the information provided by the interviewees. The findings of this report are not 100% certain. If the managers approve, the evaluation process will continue to examine the evidence more deeply and increase the confidence factor.",
  "evaluation_process": "Evaluation process (How was this report built?)",
  "how_was_this_report_built": "How was this report built?",
  "introduction": "Introduction",
  "introductionReport": "Report introduction",
  "isDraftSpaceReport": "To share this report, you can either make it public or move the related assessment to a space.",
  "kitWithTitle": "{{title}} kit",
  "maturityLevelsDescription": "In this assessment kit, there are {{maturityLevelCount}} different maturity levels, each defined in the table below. At the end of the assessment process, the maturity level of each indicator is determined.",
  "peopleWithAccess": "People with access",
  "overallStatus": "Overall status",
  "participants": "Participants",
  "publishReport": "Publish report",
  "PublicShareTitle": "Public access (No login required)",
  "PublicShareDescription": "Anyone with the link can view the report without needing to login.",
  "questionsAndAnswer": "{{count}} questions and answers",
  "quickAccess": "Quick access",
  "recommendations": "Recommendations",
  "helpDescription": "This chart shows how much each measure contributes to a specific attribute. The length of each bar reflects its impact, and the sum of all bars equals 100%. The colors help visualize how much each measure has positively or negatively influenced the attribute. Hovering over a bar reveals the exact percentage of gained or missed score. This breakdown allows you to quickly identify strengths and opportunities for improvement within each area.",
  "maturityMapOfAssessedAttributes": "Maturity map of assessed attributes",
  "maturityMapOfAssessedAttributesGuidance": "The assessment was conducted using a specialized kit that provides a detailed and technical evaluation of various system attributes—each attribute representing a key aspect of system quality.<br/>The chart below presents a visual summary of the assessed attributes, showing their relative maturity levels and importance within the evaluation. Each block represents an attribute, with its size reflecting its weight in the assessment and its color indicating the maturity level based on the scoring scale defined for this specific evaluation.<br/>It offers a clear snapshot of how different areas of the system compare in terms of maturity, supporting informed analysis and discussion.",
  "measureStatus": "Measure status",
  "measureTitle": "Measure title",
  "reportIssues": "Report issues",
  "report": "report",
  "reportTitle": "Report",
  "requestAnExpertReview": "Request an expert review",
  "requestAnExpertReviewContent":"We can share your questionnaire responses with a team of experienced assessors who have domain-specific expertise aligned with your software. Their involvement can result in an assessment with greater accuracy, depth, and quality than the current AI-assisted report. <br/>Our specialists will be in direct contact with you throughout the process. <br/>Please note that this is a paid service. To explore a potential collaboration, please share your contact details and brief information about your software—such as business domain, brand name, and other relevant context.",
  "restrictedShareTitle": "Restricted access (Only users with access) ",
  "restrictedShareDescription": "Accessible only to users who’ve been given access.",
  "shareReport": "Share report",
  "shareReportViaEmail": "Share the report with new people via email...",
  "strengths_and_weaknesses": "Strengths and weaknesses",
  "strengthsAndAreasForImprovement": "Strengths and areas for improvement",
  "subjectGuidance": "This assessment evaluated several overarching subjects of the software system, with the chart below illustrating the maturity level of each subject. The following sections of the report present in‑depth analyses of their current status and the specific attributes evaluated within each subject.",
  "subjectsOverview": "Subjects overview",
  "shareOptions": "Sharing options",
  "topicsAndIndicators": "Topics and indicators",
  "topicsTable": "The table below explains each of the topics and indicators.",
  "viewReport": "View report",
  "writeAboutParticipants": "Write about the participants and their roles in this assessment here...",
  "writeIntroduction": "Write the introduction of the report here...",
  "writeStepsForAssessment": "Write about the steps taken in this assessment here...",
  "writeStrengthAndAreas": "Write about strengths and areas for improvement here...",
  "writeYourInsightsOfTheAssessmentResultsHere": "Write your insights of the assessment results here..."
}
