{
  "addFirstOption": "Add first option",
  "answerOptions": "Answer options",
  "answerRangeEmptyStateDetailed": "Don’t worry! We made it easy for you. Just click the button below to create your first template.",
  "answerRangeKitDesignerDescription": "Before creating questionnaires and questions, you can set up templates for answer options in your kit. These templates make building questions faster and more efficient, and are available when you create new questions. Each template includes the number and title of the options, and the percentage each option contributes to the overall score.",
  "answerRangeListEmptyState": "No answer range has been created yet.",
  "answerRanges": "Answer ranges",
  "attribute": "Attribute",
  "attributeEmptyStateDetailed": "Don’t worry! We made it easy for you. Just click the button below to create your first attribute.",
  "attributesKitDesignerDescription": "Attributes are the most critical components of an evaluation. The maturity level of an evaluation is determined based on the maturity levels of the subjects and by calculating their weighted average. Each subject consists of several attributes, and its score is derived from the weighted average of these attributes.<br/>In this section, you can define the subjects relevant to your evaluation, add the necessary descriptions for them, and determine the weight of each subject in the final calculation of the evaluation's maturity level.",
  "attributesListEmptyState": "No attribute is defined.",
  "changeOrderHelper": "Drag each item to change the order (This order is ascending)",
  "chooseAnswerRange": "Choose an answer range",
  "deleteAttribute": "Are you sure you want to delete this attribute?",
  "deleteDraft": "Delete draft",
  "deleteDraftConfirmationMessage": "Are you sure you want to delete this draft?<br/> This action cannot be undone. All unsaved changes will be lost.",
  "deleteMaturityLevel": "Are you sure you want to delete this maturity level?",
  "deleteQuestionnaire": "Are you sure you want to delete this Questionnaire?",
  "disableAttributeMessage": "You can't add a new attribute until you have at least one subject.",
  "emptyAnswerRange": "No answer range has been created yet.",
  "impactsOn": "Impacts on",
  "kitDesigner": "Kit designer",
  "addLanguage": "Add language",
  "availableLanguages": "Available languages",
  "generalDescription": "Welcome to the Kit Designer. This section is your first step towards creating a software assessment kit. By completing the required information in this section, your kit will be created, and you can then proceed to customize the details of your kit, such as defining maturity levels, setting up subjects, creating questionnaires, and more.",
  "mainLanguage": "Main language: {{lang}}",
  "measures": "Measures",
  "measuresKitDesignerDescription": "To begin the assessment process, you first need to define the measures that will be used to evaluate each attribute. Measures represent specific attributes, criteria, or actions that contribute to the overall performance of an attribute. Defining them clearly ensures a structured and meaningful evaluation. By setting up your measures: You establish a consistent basis for scoring, align the evaluation with organizational goals or standards, and enable accurate analysis and visualization of performance impact. Once defined, these measures will be used in subsequent visualizations to highlight strengths, weaknesses, and areas for improvement. Please start by creating and organizing the measures relevant to your context.",
  "newMeasure": "New measure",
  "selectMeasure": "Select measure",
  "translatedLanguage": "Translated language: {{lang}}",
  "kitErrorsTitle": "Issues have been found in the kit and it cannot be released. Please resolve the issues and try again.",
  "kitValidated": "All good! The kit has been successfully validated and is ready to be released.",
  "maturityLevelsKitDesignerDescription": "Maturity levels are a structured way to assess and improve the development and capabilities of processes, systems, or organizations. Typically, these levels are part of a maturity model, which provides a framework for evaluating how well an entity is performing in a specific domain.<br/> In this section, in addition to defining the various maturity levels, you need to establish the relationship between these levels and the criteria for achieving each maturity level based on the preceding levels.",
  "maturityLevelsListEmptyState": "No maturity level is defined.",
  "maturityLevelsListEmptyStateDetailed": "No maturity level at the moment? You can define new ones via this button!",
  "measureEmptyStateDetailed": "No measures in this kit so far? Create your first measure with one click!",
  "measuresListEmptyState": "No measure is created.",
  "newAnswerRange": "New answer range",
  "newAttribute": "New attribute",
  "newImpact": "New impact",
  "newMaturityLevel": "New maturity level",
  "newOption": "New option",
  "newOptionImpact": "New option impact",
  "newQuestion": "New question",
  "newQuestionnaire": "New questionnaire",
  "newSubject": "New subject",
  "noOptionAtTheMoment": "No options for answer at the moment.",
  "noOptionHere": "No option here!",
  "noQuestionHere": "No question here!",
  "optionsEmptyState": "No option so far",
  "optionsEmptyStateDetailed": "Options are necessary to create questions! Create your first option here.",
  "optionsImpactsDescription": "Impact indicates how and to what extent the options of a question affect various attributes. This effect can vary across different maturity levels, meaning an option can have different impacts on multiple attributes at different maturity levels. The maximum impact weight of an option is 1.",
  "optionsImpactsDisabled": "You can't add a new impact until you've created options and attributes.",
  "optionsImpactsEmptyState": "No attribute is impacted by this question yet!",
  "optionsImpactsEmptyStateDetailed": "A question has to impact at least one attribute to be created and added to the questionnaire.",
  "publishDescription": "In this section, the content of the kit is automatically reviewed and validated. If no errors are found, you can release the kit and make it available. If there are any errors, you need to resolve them before the kit can be released.",
  "questionImpacts": "Impacts",
  "questionnairesEmptyStateDetailed": "Questionnaires are necessary to create questions! Create your first questionnaire here.",
  "questionnairesKitDesignerDescription": "Questionnaires provide a structure for organizing and categorizing various questions. By dividing an assessment into different questionnaires, evaluators who intend to use your kit can navigate and utilize your assessment more easily. Questions can be categorized in various ways, but the most common method is by topic. In this way, questions that are most similar in terms of the topic are grouped into one questionnaire. It is recommended that each questionnaire contains a maximum of 15 questions and a minimum of 3 questions.",
  "questionnairesListEmptyState": "No questionnaire has been created so far.",
  "questionPlaceholder": "Write the question here",
  "release": "Release",
  "releaseNote": "Note: All changes you make are saved automatically as a draft.",
  "subjectEmptyStateDetailed": "No subjects in the kit so far? Create your first subject with one click!",
  "subjectsKitDesignerDescription": "Subjects are the most critical components of an evaluation. The maturity level of an evaluation is determined based on the maturity levels of the subjects and by calculating their weighted average. Each subject consists of several attributes, and its score is derived from the weighted average of these attributes. In this section, you can define the subjects relevant to your evaluation, add the necessary descriptions for them, and determine the weight of each subject in the final calculation of the evaluation's maturity level.",
  "subjectsListEmptyState": "No subject is created.",
  "validateReleaseTooltip": "Your kit cannot be released until all errors are resolved."
}
